var express = require('express');

// 路由
var router = express.Router();

// 首页
router.get('/', function (req, res) {
    res.send('全镇社区 - 小区一览表');
});


/**
 * 全镇社区 - 小区一览表
 */
router.get('/qzzl', function (req, res) {
    var data = [{
        "name": "陈巷村 (社区)",
        "estates": ["陈巷花园", "陈巷村 (尚未拆迁的组别)"]
    }, {
        "name": "陆家村 (社区)",
        "estates": ["联谊花园", "育才小区", "碧湖苑", "菉溪新村", "鹤塘新村", "长丰新村 (包括牧医新村)", "陆粮新村", "龙溪新村", "菉溪商住1幢", "童泾路30#", "童泾商住", "水厂商住", "龙溪路", "龙王庙粮库商品房", "木瓜东路33号 (老街教师楼)", "白鹤溇", "杨厅弄", "东弄", "新宅弄", "黄家弄", "银行楼", "食品站楼", "税务所公房", "星旺商苑", "镇南路2#商品房", "新开河路47号", "煤屑弄", "鹤塘路", "木瓜西路", "炊具厂商品房及公房", "造船厂公房", "服装厂公房", "育才路西侧国二厂商品房", "育才路以东 (供销社、粮机厂、中小学教师) 商品房", "兴学弄", "唐板桥", "质夫路", "香严街", "古木弄", "北更溇", "韩泾村", "唐家宅", "施家宅", "渔业村", "黄泥浜", "陈家浜", "小夏驾村民小组"]
    }, {
        "name": "神童泾村 (社区)",
        "estates": ["珠海新村", "南粮花园", "龙王老区 (吴淞江以北)", "好孩子公寓", "园丁新村", "富荣尊苑", "陆电新村", "东方假日城", "徐里新村", "神童花园", "云立方"]
    }, {
        "name": "泗桥村 (社区)",
        "estates": ["常发豪郡", "美吉特", "仕泰隆", "老泗桥村 (未拆迁)"]
    }, {
        "name": "邹家角村 (社区)",
        "estates": ["名湖花园及别墅", "联谊新村", "木瓜小区 (木瓜别墅、木瓜多层)", "桃园春天", "启发广场", "涂料新村", "华昆公寓", "水岸香堤", "新开河路1号", "新开河路17号", "韩泾村 (韩泾河以东)"]
    }, {
        "name": "夏桥村 (社区)",
        "estates": ["夏桥家园", "夏桥花园", "河庄3组", "杨春浜", "夏桥南村", "北村 (未动迁户)"]
    }, {
        "name": "车塘村 (社区)",
        "estates": ["邵村北苑", "杏花北苑", "东景苑", "阳光新地", "山水江南", "香花苑", "老车塘", "香花公寓"]
    }, {
        "name": "合丰村 (社区)",
        "estates": ["南泾岸新村", "里巷新村", "丰安苑", "新安新村", "合丰新村", "佳茂缘", "摩玛公社", "白杨湾", "财富湾小区", "宜家花园", "龙邑小区", "珠竹花苑", "沙葛新村", "青春雅居", "南石桥", "新昆公寓", "沙家村", "市头浦"]
    }, {
        "name": "邵村社区",
        "estates": ["邵村南苑", "邵村家园", "杏花南苑", "博怡轩 (博雅景园)", "蒋巷北苑", "蒋巷南苑"]
    }, {
        "name": "企业集体宿舍",
        "estates": ["正新橡胶（中国）有限公司", "好孩子儿童用品有限公司", "昆山华冠商标印刷有限公司", "膳魔师（中国）家庭制品有限公司", "柏承科技（昆山）股份有限公司", "昆山新莱洁净应用材料股份有限公司", "马斯特模具（昆山）有限公司", "昆山莎美娜制衣有限公司", "国瑞创业园", "深国际物流园", "大同齿轮（昆山）有限公司", "昆山宁华消防系统有限公司", "昆山市乾亨表面处理有限公司", "冠亿精密工业（昆山）有限公司", "华声电子科技（昆山）有限公司", "卓越五金弹簧（昆山）有限公司"]
    }, {
        "name": "集体资产管理点",
        "estates": ["香花公寓", "摩玛公社"]
    }, {
        "name": "工地",
        "estates": []
    }, {
        "name": "学校",
        "estates": ["陆家高级中学", "陆家中学", "陆家中心校东校区", "陆家中心校西校区", "菉溪小学", "菉溪小学沙葛校区", "陆家中心幼儿园", "菉溪幼儿园", "昆山上交南洋附属学校", "夏桥小学", "夏桥幼儿园", "东方幼儿园", "东方合丰幼儿园", "东方泗桥幼儿园", "育才幼儿园", "蒋巷学前儿童看护点", "香花贝贝学前儿童看护点", "车塘学前儿童看护点", "小太阳学前儿童看护点", "奇智宝贝学前儿童看护点"]
    }]
    res.send(data);
});


module.exports = router;